import 'dart:math';

class JokesCollection{
  List<String> randomJokes;
  Random random = Random();

  List<String> jokes = [

    'एकदिन ध्रुमुस ले सुन्तली लाई भनेछ, सुन्तली रेखा थापालाई त एङ्ग्लिश नै बोल्न न आउदो रहेछ नि, अनि सुन्तली ले सोध्छ, होर धुर्मुस तिमलाई कसरि थाहा भयो नि, धुर्मुस ले भन्छ मैले give me a kiss भनेको त एक थप्पड पो दि त !',

    'धेरै ह्यान्डसम हुनु पनि अभिश्राप नै हुदो रहेछ, छिमेकी को छोरी पोइला गैभने म घर मा छु कि छैन  भनेर चेक गर्न आउछन भन्या, कस्तो तनाब !',

    'फेसबुकमा रिप्लाई भनेको त दामी पो दिनु पर्छ त , हम्म , उम्म त गाई बाख्राले पो गर्छ त !',

    'पुलिस ले एकदिन accident  भको ठाउमा गएर डाएभर लाई सोधेछ, भाइ accident कसरि भयो, अनि डायाभर ले भनेछ, खै सर म पछाडी भाडा उठाउन गको थि !',

    'मैले सुनेको दारु खान हिनेको पुरुस र दर खान हिनेको आइमाई लाई कसैले पनि रोक्न सक्दैन रे ',

  'एकदिन सेरेले माहादेव लाई भनेछ, प्रभु मलाई यौटा bike चाहियो अनि माहादेवले जवाफ दिएछ , आफु त या साढे चढेर हिंनु परिराछ, अनि फेरि सेरेले भन्छ तेसो भए ६०१ ओटा सभाषद लाई बुध्दि दिनुस अनि माहदेव ले भन्छ छिटो भन कुन मोडेल को बिले चाहियो',


  'talent को कुरा नगर केटा केटि हरु मा संग, क्यालेन्डर ले पुष भन्दा त नपुशी हेर्ने मान्छे मै हो',


  'काले ले पुलिस को जागिर पायछ अनि येस्तैमा एकदिन राति उसैको घर मा चोर आयछ कालेको श्रीमती आत्तिदै .. ए हजुर उठनुना घरमा चोर पस्यो अनि कालेले भनेछ पस्न दे म अहिले डिउटिमा छैन',


  'एक्लो पनको महशुस त तेती बेला हुन्छ जति बेला हात नपुग्ने ठाउमा ढाड चिलाउछ',


  '३२ गुनले भरिपुर्ण भन्छन नि हो मा तेही हु',


  'मलाई नेपाल कति गरिब रहेछ भन्ने त्यति बेला थाहा भयो जब motercycle  पुछ्न राखेको टालो bike  बाट गाएब भयो',

    'केटि घुमाउन नसक्ने त म पनि हैन नि, माया लाग्छ बिचरीलाई रिंगटा लाग्ला कि भनेर ',

    'सलमान खान ले भनेछ दुनियाको सबै ठाउँ मा गको छु म अनि तेस्पक्षि राजेश हमाल दाइ ले जवाफ दिनुभएछ धेरै फुर्ति नदेखा भाइ, ससुराली गा छस ',

  'Exam आएर पढ़िराको छु तर के पढ़िराको छु भनेर चाहि मलाई नै याद छैन',

  'life is a race भन्थे हो रहेछ , कुदेरै नै जाने भयो जिन्दगि',


  'बोल्दैन त्यो तस्बिर तिम्रो हेर्दा हेर्दै रात बित्यो , अनि दिक्क लागेर फोटो डिलिट गर्दिए',

  'आत्महत्या गर्न भनेर झुन्डेको सास फेर्न नसकेर झन्डै नमरेको यार',

  'साला जिन्दगि त दुइ दिनको पो रहेछ त मैले त भुलेर इन्टरनेट प्याक एक महिनाको पो लिए त',

  'मान्छे हरु फोटो खिच्दै नराम्रो आयो भन्दै डिलिट गर्दै फेरि खिच्दै गरेको देख्दा लास्तई हासो लाग्छ , ए बाबा थोपदा नै तेस्तो छ त कसरि आओस राम्रो',

  'जिन्दगि मा आशु पुछिदिने धेरै होला तर सिगान पुछिदिए कोहि हुदैनन तेसैले सधै औता रुमाल बोकेर हिन्नुस',

  'नखुलेको आकाश खुलेर आयो जति पढे पनि भुलेर आयो, पढ्न भनि कलेज गाको छोरो दिनभर केटि संग डुलेर आयो',

  'साला आज नेपालीको exam मा राष्ट्रिय गान लेखेर आइयो , उठी उठी पेपर चेक गर्दै होला बुढोले',



  ];
}